#include <stdio.h>
#include <stdlib.h>

int main()
{
    /* (a.)printf("%-10d\n",10000); ผิดเพราะใช้ %-10d ต้องเปลี่ยนให้เป็น %d ดังนั้นเพื่อให้คำสั่งนั้นถูกต้อง จะได้ */
    printf("%d\n",10000);
    /* (b.)printf("%c\n","this is a string"); /*ผิดเพราะ  %c ไม่สามารถใช้ใน string ได้ ต้องเปลี่ยนเป็น %s ดังนั้นเพื่อให้คำสั่งนั้นถูกต้อง จะได้*/
    printf("%s\n","This is a string");
    /* (c.)printf("%*.*lf\n",8,3,1024.987654); /*ผิดเพราะใช้ %*.*lf ต้องใช้เป็น %d %d %lf ดังนั้นเพื่อให้คำสั่งนั้นถูกต้อง จะได้ */
    printf("%d %d %lf\n",8,3,1024.987654);
    /* (d.)printf("% ld\n%+ld\n",1000000,1000000); /*ผิดเพราะใช้ตัว % ผิดตำแหน่ง ต้องใช้เป็น %ld\n+%d\n ดังนั้นเพื่อให้คำสั่งนั้นถูกต้อง จะได้*/
    printf("%ld+%ld\n",1000000,1000000);
    /* (e.)printf("%10.2E\n",444.93738); /*ผิดเพราะ ใช้ %10.2E ต้องเปลี่ยนให้เป็น %.5f เพราะเป็นเลขทศนิยม 5 ตำแหน่ง ดังนั้นเพื่อให้คำสั่งนั้นถูกต้อง จะได้*/
    printf("%.5f\n",444.93738);
    /* (f.)printf("%d\n",10.987); /*ผิดเพราะใช้ %d ต้องเปลี่ยนมาใช้  %.3f เพราะเป็นเลขทศนิยม 3 ตำแหน่ง    ดังนั้นเพื่อให้คำสั่งนั้นถูกต้อง จะได้ */
    printf("%.3f\n",10.987);
    return 0;
}
